uni/informatik/medienretrieval/answers.html
<?xml version="1.0" encoding="utf-8"?>
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-02-26 Wed 16:53 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="John Doe" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgdd264e2">1. <span class="done DONE">DONE</span> Beschreiben Sie IDF und TF</a></li>
<li><a href="#org65c1999">2. <span class="done DONE">DONE</span> Erläutern Sie das Zipf&rsquo;sche Gesetz, die Luhn&rsquo;sche Termgewichtung und ihre praktische Bedeutung</a></li>
<li><a href="#org2b4dca8">3. <span class="done DONE">DONE</span> Beschreiben Sie die prinzipiellen Möglichkeiten des CBIR</a></li>
<li><a href="#org63770ae">4. <span class="done DONE">DONE</span> Welche Hauptmethoden der Stammformreduktion gibt es?</a></li>
<li><a href="#org58638cc">5. <span class="done DONE">DONE</span> Erläutern Sie den Unterschied zwischen N-Gram-Stemmern und Affix-Stemmern.</a></li>
<li><a href="#org0ede74b">6. <span class="done DONE">DONE</span> Erklären Sie die Maße Recall und Precision.</a></li>
<li><a href="#org4da17f7">7. <span class="done DONE">DONE</span> Beschreiben Sie Vorteile und Funktionsweise des twin-comparison-Verfahrens.</a></li>
<li><a href="#org1cfd691">8. <span class="todo TODO">TODO</span> Es existiert ein Retrievalsystem für Insektenbilder. Sie sollen eine Evaluation durchführen. Beschreiben Sie ihre Vorgehensweise.</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgdd264e2" class="outline-2">
<h2 id="orgdd264e2"><span class="section-number-2">1</span> <span class="done DONE">DONE</span> Beschreiben Sie IDF und TF</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Side note: In <b>jeder</b> Altklausur besteht die erste Aufgabe aus der Beschreibung von IDF. In einigen Klausuren wird zusätzlich noch die Beschreibung von TF verlangt</li>
</ul>

<p>
<b>Wikipedia Engl Summary</b><br />
In information retrieval, <b>tf–idf</b> or <b>TFIDF</b>, short for <b>term frequency–inverse document frequency</b>, is a numerical statistic that is intended to reflect how important a word is to a document in a collection or corpus. It is often used as a weighting factor in searches of information retrieval, text mining, and user modeling. The tf–idf value increases proportionally to the number of times a word appears in the document and is offset by the number of documents in the corpus that contain the word, which helps to adjust for the fact that some words appear more frequently in general. tf–idf is one of the most popular term-weighting schemes today; 83% of text-based recommender systems in digital libraries use tf–idf.
</p>

<p>
Variations of the tf–idf weighting scheme are often used by search engines as a central tool in scoring and ranking a document&rsquo;s relevance given a user query. tf–idf can be successfully used for stop-words filtering in various subject fields, including text summarization and classification.
</p>

<p>
One of the simplest ranking functions is computed by summing the tf–idf for each query term; many more sophisticated ranking functions are variants of this simple model.
</p>

<p>
<b>TF (Term Frequency)</b>: Suppose we have a set of English text documents and wish to rank which document is most relevant to the query, &ldquo;the brown cow&rdquo;. A simple way to start out is by eliminating documents that do not contain all three words &ldquo;the&rdquo;, &ldquo;brown&rdquo;, and &ldquo;cow&rdquo;, but this still leaves many documents. To further distinguish them, we might count the number of times each term occurs in each document; the number of times a term occurs in a document is called its term frequency. However, in the case where the length of documents varies greatly, adjustments are often made (see definition below). The first form of term weighting is due to Hans Peter Luhn (1957) which may be summarized as: <i>The weight of a term that occurs in a document is simply proportional to the term frequency.</i>
</p>

<p>
<b>IDF (Inverse Document Frequency)</b>: Because the term &ldquo;the&rdquo; is so common, term frequency will tend to incorrectly emphasize documents which happen to use the word &ldquo;the&rdquo; more frequently, without giving enough weight to the more meaningful terms &ldquo;brown&rdquo; and &ldquo;cow&rdquo;. The term &ldquo;the&rdquo; is not a good keyword to distinguish relevant and non-relevant documents and terms, unlike the less-common words &ldquo;brown&rdquo; and &ldquo;cow&rdquo;. Hence an inverse document frequency factor is incorporated which diminishes the weight of terms that occur very frequently in the document set and increases the weight of terms that occur rarely.
</p>

<p>
Karen Spärck Jones (1972) conceived a statistical interpretation of term specificity called Inverse Document Frequency (idf), which became a cornerstone of term weighting: <i>The specificity of a term can be quantified as an inverse function of the number of documents in which it occurs.</i>
</p>

<hr />

<p>
<b>Wikipedia Ger Summary</b><br />
Das Tf-idf-Maß (von englisch term frequency ‚Vorkommenshäufigkeit‘ und inverse document frequency ‚inverse Dokumenthäufigkeit‘) wird im Information Retrieval zur Beurteilung der Relevanz von Termen in Dokumenten einer Dokumentenkollektion eingesetzt.
</p>

<p>
Mit der so errechneten Gewichtung eines Wortes bezüglich des Dokuments, in welchem es enthalten ist, können Dokumente als Suchtreffer einer wortbasierten Suche besser in der Trefferliste angeordnet werden, als es beispielsweise über die Termfrequenz allein möglich wäre.
</p>

<p>
<b>IDF:</b> Die Inverse Dokumenthäufigkeit (englisch Inverse Document Frequency (IDF)) dient beim Information Retrieval zur Bestimmung der Trennfähigkeit eines Wortes bzw. Termes für die Indexierung von Dokumenten. Ein Wort, das nur in wenigen Dokumenten oft vorkommt, ist geeigneter als eines, das in fast jedem Dokument oder nur sehr gering auftritt. Zusammen mit der Termfrequenz (siehe Tf-idf-Maß) wird sie zur Gewichtung von Wörtern bei der Automatischen Indexierung eingesetzt.<br />
Die Inverse Dokumenthäufigkeit lässt sich berechnen als \[IDF_t = \log(\frac{N_D}{f_t})\]
wobei N<sub>D</sub> die Anzahl der Dokumente bezeichnet und f<sub>t</sub> die Anzahl der Dokumente, die den Term t enthalten. Wenn die Dokumentenhäufigkeit wächst, wird der Bruch kleiner.<br />
</p>

<p>
Die inverse Dokumenthäufigkeit misst die Spezifität eines Terms für die Gesamtmenge der betrachteten Dokumente. Ein übereinstimmendes Vorkommen von seltenen Begriffen ist für die Relevanz aussagekräftiger als eine Übereinstimmung bei sehr häufigen Worten (z. B. &ldquo;und&rdquo; oder &ldquo;ein&rdquo;).
Die inverse Dokumentfrequenz <code>idf(t)</code>  eines Terms <code>t</code> hängt nicht vom einzelnen Dokument, sondern vom Dokumentkorpus (der Gesamtmenge aller Dokumente im Retrievalszenario) ab.
</p>

<p>
<b>TF:</b> Die Vorkommenshäufigkeit (auch Suchwortdichte genannt) <code>#(t,D)</code> gibt an, wie häufig der Term <code>t</code> im Dokument <code>D</code> vorkommt. Ist beispielsweise das Dokument <code>D_{i}</code> der Satz
&ldquo;<i>Das rote Auto hält an der roten Ampel.</i>&rsquo;&rdquo; dann ist  <code>#(rot, D_i)=2</code>. Um eine Verzerrung des Ergebnisses in langen Dokumenten zu verhindern, ist es möglich, die absolute Vorkommenshäufigkeit <code>#(t,D)</code>  zu normalisieren. Dazu wird die Anzahl der Vorkommen von Term <code>t</code> in Dokument <code>D</code> durch die maximale Häufigkeit eines Terms in <code>D</code> geteilt und man erhält die relative Vorkommenshäufigkeit <code>tf(t,D)</code>.
</p>
</div>
</div>
