uni/informatik/medienretrieval/answers.html
<div id="outline-container-org2b4dca8" class="outline-2">
<h2 id="org2b4dca8"><span class="section-number-2">3</span> <span class="done DONE">DONE</span> Beschreiben Sie die prinzipiellen Möglichkeiten des CBIR</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Side note: Diese Aufgabe ist in 3 Altklausren.</li>
</ul>

<p>
Unter Content Based Image Retrieval (CBIR) versteht man eine inhaltsbasierte Bildersuche. Dabei handelt es sich um ein Spezialgebiet der Bildverarbeitung und des Wiederauffindens von Information (Information Retrieval) in großen Datenbeständen. „Inhaltsbasiert“ (content based) bedeutet dabei eine Analyse des aktuellen Inhaltes eines Bildes, also der Farben, Umrisse, Oberflächen (Texturen) oder anderer Informationen (sogenannte Merkmalsvektoren), die über eine automatische Bildverarbeitung ermittelt werden können. Die Aufgabe der Bildersuche ist es, eine Liste vorhandener Bilder so zu sortieren, dass die gesuchten Bilder (etwa anhand eines Referenzbildes) möglichst weit vorne stehen. Bilder werden anhand ihrer Ähnlichkeit zum Referenzbild sortiert, die sich durch eine Distanzfunktion und die Merkmalsvektoren der Bilder bestimmt. Ein Qualitätsmaß beurteilt die Sortierung, die maßgeblich von der Wahl der Merkmalsvektoren und des Ähnlichkeitsmaßes abhängt. Die inhaltsbasierte Bildersuche wird angewandt für Bilderdatenbanken, im Bereich der medizinischen Bildverarbeitung und bei der Suche nach Plagiaten (Near Duplicate Detection).
Im Bereich der Websuchmaschine, wird je nach Anbieter auch von &ldquo;reverser Bildersuche&rdquo; (reverse image search) oder einer &ldquo;visuellen Suchmaschine&rdquo; (visual search engine) gesprochen.
</p>

<p>
Type of Queries in Image Retrieval:
</p>
<ul class="org-ul">
<li>(query by text) &rarr; <b>*not content based</b> (CBIR)</li>
<li>Query by example</li>
<li>Query by sketch</li>
<li>Query by color</li>
<li>Query by texture</li>
</ul>

<p>
<b>Query By Example</b> is a query technique that involves providing the CBIR system with an example image that it will then base its search upon. The underlying search algorithms may vary depending on the application, but result images should all share common elements with the provided example. Options for providing example images to the system include:
</p>
<ul class="org-ul">
<li>A preexisting image may be supplied by the user or chosen from a random set.</li>
<li>The user draws a rough approximation of the image they are looking for, for example with blobs of color or general shapes.</li>
</ul>
<p>
This query technique removes the difficulties that can arise when trying to describe images with words.<br />
</p>

<p>
<b>Semantic retrieval</b> starts with a user making a request like &ldquo;find pictures of Abraham Lincoln&rdquo;. This type of open-ended task is very difficult for computers to perform - Lincoln may not always be facing the camera or in the same pose. Many CBIR systems therefore generally make use of lower-level features like texture, color, and shape. These features are either used in combination with interfaces that allow easier input of the criteria or with databases that have already been trained to match features (such as faces, fingerprints, or shape matching). However, in general, image retrieval requires human feedback in order to identify higher-level concepts.
</p>

<p>
Other query methods include browsing for example images, navigating customized/hierarchical categories, querying by image region (rather than the entire image), querying by multiple example images, querying by visual sketch, querying by direct specification of image features, and multimodal queries (e.g. combining touch, voice, etc.).
</p>

<p>
The most common method for comparing two images in content-based image retrieval (typically an example image and an image from the database) is using an image distance measure. An image distance measure compares the similarity of two images in various dimensions such as color, texture, shape, and others. For example, a distance of 0 signifies an exact match with the query, with respect to the dimensions that were considered. As one may intuitively gather, a value greater than 0 indicates various degrees of similarities between the images. Search results then can be sorted based on their distance to the queried image. Many measures of image distance (Similarity Models) have been developed. Most commonly distance computing measures are based on <b>color</b>, <b>texture</b> or <b>shape</b>.
</p>

<p>
<b>Color</b><br />
Computing distance measures based on color similarity is achieved by computing a color histogram for each image that identifies the proportion of pixels within an image holding specific values. Examining images based on the colors they contain is one of the most widely used techniques because it can be completed without regard to image size or orientation. However, research has also attempted to segment color proportion by region and by spatial relationship among several color regions.
</p>

<p>
<b>Texture</b><br />
Texture measures look for visual patterns in images and how they are spatially defined. Textures are represented by texels which are then placed into a number of sets, depending on how many textures are detected in the image. These sets not only define the texture, but also where in the image the texture is located.<br />
Texture is a difficult concept to represent. The identification of specific textures in an image is achieved primarily by modeling texture as a two-dimensional gray level variation. The relative brightness of pairs of pixels is computed such that degree of contrast, regularity, coarseness and directionality may be estimated. The problem is in identifying patterns of co-pixel variation and associating them with particular classes of textures such as silky, or rough.<br />
Other methods of classifying textures include:
</p>
<ul class="org-ul">
<li>Co-occurrence matrix, Laws texture energy, Wavelet transform, Orthogonal transforms (Discrete Tchebichef moments)</li>
</ul>

<p>
<b>Shape</b><br />
Shape does not refer to the shape of an image but to the shape of a particular region that is being sought out. Shapes will often be determined first applying segmentation or edge detection to an image. Other methods use shape filters to identify given shapes of an image. Shape descriptors may also need to be invariant to translation, rotation, and scale. Some shape descriptors include:
</p>
<ul class="org-ul">
<li>Fourier transform</li>
<li>Moment invariant</li>
</ul>


<p>
Measures of image retrieval can be defined in terms of precision and recall. However, there are other methods being considered.<br />
An image is retrieved in CBIR system by adopting several techniques simultaneously such as Integrating Pixel Cluster Indexing, histogram intersection and discrete wavelet transform methods.<br />
Machine learning and application of iterative techniques are becoming more common in CBIR.
</p>
</div>
</div>
