uni/informatik/medienretrieval/answers.html

<div id="outline-container-org63770ae" class="outline-2">
<h2 id="org63770ae"><span class="section-number-2">4</span> <span class="done DONE">DONE</span> Welche Hauptmethoden der Stammformreduktion gibt es?</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Side note: Diese Aufgabe ist in 4 Altklausuren und zwar immer dann, wenn die Frage nach N-Gram-Stemmern und Affix-Stemmern nicht auftritt (selbes Thema).</li>
<li>Alternativ: Nennen Sie 3 Arten von Stemmern.</li>
</ul>

<p>
Es gibt prinzipiell 3 Arten von Stemmern (Stammformreduktion):
</p>
<ul class="org-ul">
<li>dictionary-based stemmers</li>
<li>n-gram stemmers</li>
<li>affix stemmers</li>
</ul>
<p>
N-Gram-Stemmer und Affix-Stemmer zählen zur Kategorie der algorithmischen Stemmer.<br />
Affix Stemmer beziehen sich wie der Name schon sagt grundsätzlich auf sogenannte Affixe. Zu Affixen zählen Prefixe (<i>un/happy), Infixe (ein/ge/schoben) und Suffixe (fit/ted</i>).
Klassische Affix-Stemmer sind zB der Porter Stemmer, der Snowball Stemmer und Krovetz (Kstem). Der Porter Stemmer arbeitet beispielsweise mit Vokal-Konsonant-Folgen um Suffixe zu entfernen.<br />
Ein dictionary-based stemmer (zB Hunspell) definiert einen sogennanten dictionary mit dessen Hilfe sich Wortvariationen auf die jeweiligen Stämme reduzieren lassen. Dafür legt er mehrere &ldquo;Regeln&rdquo; fest.<br />
Ein N-Gramm ist das Ergebnis einer Wortzerlegung in einzelne, jeweils zu N-aufeinanderfolgende Fragmente zusammengefasst. Ein 2-gram stemmer bezieht sich auf sogenannte Bigramme also Fragmente die aus zwei Zeichen bestehen, ein 3-gram stemmer hingegen auf Trigramme undsoweiter. Um somit die Ähnlichkeit von bestimmten Termen zu bestimmen werden die Worte beispielsweise in ihre Trigramme zerlegt und anschließend wird die Distanz zwischen den Worten über ihre Fragemente berechnet.<br />
</p>
</div>
</div>
<div id="outline-container-org58638cc" class="outline-2">
<h2 id="org58638cc"><span class="section-number-2">5</span> <span class="done DONE">DONE</span> Erläutern Sie den Unterschied zwischen N-Gram-Stemmern und Affix-Stemmern.</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>Side note: Diese Aufgabe ist in 3 Altklausren und zwar immer dann, wenn die Frage nach Hauptmethoden der Stammformreduktion nicht auftritt (selbes Thema).</li>
</ul>
<p>
Zur Beantwortung dieser Frage, siehe vorherige Frage.
</p>
</div>
</div>
<div id="outline-container-org0ede74b" class="outline-2">
<h2 id="org0ede74b"><span class="section-number-2">6</span> <span class="done DONE">DONE</span> Erklären Sie die Maße Recall und Precision.</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>Side note: Diese Aufgabe ist nur in 2 Altklausuren.</li>
</ul>

<p>
Recall (Trefferquote) und Precision (Genauigkeit, Präzision) sind Maße zur Evaluierung Information Retrieval Systemen. Es geht hier primär darum die Relevanz von gefundenen Informationen/Dokumenten zu beurteilen. Die Trefferquote gibt den Anteil der bei einer Suche gefundenen relevanten Dokumente und damit die Vollständigkeit eines Suchergebnisses an. Die Genauigkeit beschreibt mit dem Anteil relevanter Dokumente an der Ergebnismenge die Genauigkeit eines Suchergebnisses. Der (weniger gebräuchliche) Ausfall bezeichnet den Anteil gefundener irrelevanter Dokumente an der Gesamtmenge aller irrelevanten Dokumente, er gibt also in negativer Weise an, wie gut irrelevante Dokumente im Suchergebnis vermieden werden.<br />
Statt als Maß können Recall und Precision und Fallout auch als Wahrscheinlichkeit interpretiert werden:
</p>
<ul class="org-ul">
<li>Recall/Trefferquote ist die Wahrscheinlichkeit, mit der ein relevantes Dokument gefunden wird (Sensitivität)</li>
<li>Precision/Genauigkeit ist die Wahrscheinlichkeit, mit der ein gefundenes Dokument relevant ist (Positiver Vorhersagewert)</li>
<li>Ausfall ist die Wahrscheinlichkeit, mit der ein irrelevantes Dokument gefunden wird (Falsch-positiv-Rate).</li>
</ul>
<p>
Eine gute Recherche sollte möglichst alle relevanten Dokumente finden (richtig positiv) und die nicht relevanten Dokumente nicht finden (richtig negativ). Wie oben beschrieben, hängen die verschiedenen Maße jedoch voneinander ab. Im Allgemeinen sinkt mit steigender Trefferrate die Genauigkeit (mehr irrelevante Ergebnisse). Umgekehrt sinkt mit steigender Genauigkeit (weniger irrelevante Ergebnisse) die Trefferrate (mehr relevante Dokumente, die nicht gefunden werden). Je nach Anwendungsfall sind die unterschiedlichen Maße zur Beurteilung mehr oder weniger relevant.
</p>

<p>
<b>Beispiel</b><br />
In einer Datenbank mit 36 Dokumenten sind zu einer Suchanfrage 20 Dokumente relevant und 16 nicht relevant. Eine Suche liefert 12 Dokumente, von denen tatsächlich 8 relevant sind.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Relevant</th>
<th scope="col" class="org-left">Nicht-relevant</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Gefunden</td>
<td class="org-left"><span style='background-color:lightgreen'>8</td>
<td class="org-left"><span style='background-color:tomato'>4</td>
</tr>

<tr>
<td class="org-left">Nicht gefunden</td>
<td class="org-left">12</td>
<td class="org-left"><span style='background-color:gold'>8</td>
</tr>
</tbody>
</table>

<p>
Recall und Precision für die konkrete Suche ergeben sich aus den Werten der Konfusionsmatrix:
</p>
<ul class="org-ul">
<li>Recall(Trefferquote) = \(\frac{8}{8+12} =  \frac{8}{20} = \frac{2}{5} = 0.4\)</li>
<li>Precision(Genauigkeit) = \(\frac{8}{8+4} =  \frac{8}{12} = \frac{2}{3} = 0.67\)</li>
<li>Fallout (Abfallquote) = \(\frac{4}{4+12} =  \frac{4}{16} = \frac{1}{4} = 0.25\)</li>
</ul>

<p>
Ein Problem bei der Berechnung der Trefferquote ist die Tatsache, dass man nur selten weiß, wie viele relevante Dokumente insgesamt existieren und nicht gefunden wurden (Problem der unvollständigen Wahrheitsmatrix). Bei größeren Datenbanken, bei denen die Berechnung der absoluten Trefferquote besonders schwierig ist, wird deswegen mit der relativen Trefferquote gearbeitet. Dabei wird die gleiche Suche mit mehreren Suchmaschinen durchgeführt, und die jeweils neuen relevanten Treffer werden zu den nicht gefundenen relevanten Dokumenten addiert. Mit der Rückfangmethode kann abgeschätzt werden, wie viele relevante Dokumente insgesamt existieren.
</p>

<p>
Problematisch ist auch, dass zur Bestimmung von Trefferquote und Genauigkeit die Relevanz eines Dokumentes als Wahrheitswert (ja/nein) bekannt sein muss. In der Praxis ist jedoch oft die Subjektive Relevanz von Bedeutung. Auch für in einer Rangordnung angeordnete Treffermengen ist die Angabe von Trefferquote und Genauigkeit oft nicht ausreichend, da es nicht nur darauf ankommt, ob ein relevantes Dokument gefunden wird, sondern auch, ob es im Vergleich zu nicht relevanten Dokumenten genügend hoch in der Rangfolge eingeordnet wird. Bei sehr unterschiedlich großen Treffermengen kann die Angabe durchschnittlicher Werte für Trefferquote und Genauigkeit irreführend sein.
</p>

<ul class="org-ul">
<li>do not work independantly
<ul class="org-ul">
<li>recall increases with amout of retrieved documents</li>
<li>increasing recall -&gt; decreasing precision</li>
</ul></li>
<li>importance depends on context
<ul class="org-ul">
<li>expert systems, file search: Recall optimized</li>
<li>web: precision-optimized</li>
</ul></li>
</ul>
</div>
</div>
