uni/informatik/medienretrieval/answers.org
* DONE Beschreiben Sie Vorteile und Funktionsweise des twin-comparison-Verfahrens.
- Side note: Diese Aufgabe ist in 3 Altklausuren.
- The twin-comparison algorithm uses the difference between consecutive frames to detect a cut, and the accumulated difference over a sequence of frames to detect gradual transitions
- http://www.cad.zju.edu.cn/home/zhx/DAM/2013/lib/exe/fetch.php?media=pdf:dam2013-15.pdf
- http://www.cse.unsw.edu.au/~cs9519/lecture_notes_08/L11_COMP9519.pdf

Bei der Videoklassifikation ist das Ziel einzelne Szenen aufgrund ihrer Inhalte in bestimmte Kategorien zu unterteilen. Zusammenfassend setzt sich die Videoklassifikation aus mehreren Schritten zusammen. Ausgehend von einem Video wird zunächst eine zeitliche Segmentierung vorgenommen, um anschließend aus einzelnen Sequenzen audiovisuelle Merkmale zu extrahieren. Anhand dieser Informationen und geeigneter Klassifikationsmodelle erfolgt eine Klassifikation von Shots, die abschließend zu Szenen gruppiert werden. Bei der zeitlichen Segmentierung wird ein Video wird in mehrere Shots unterteilt, wobei eine solche Sequenz aus mehrere aufeinander folgende Frames aus einer Kameraperspektive besteht. Es wird angenommen, dass innerhalb dieser Shots wenige inhaltliche Veränderungen
auftreten, wodurch die Beschreibung erleichtert wird. Abhängig von der semantischen Bedeutung bilden mehrere /benachbarte Shots/ eine Szene. Um die benötigten Shots zu bestimmen, gilt es die Grenzen zwischen den einzelnen Sequenzen zu detektieren, wobei verschiedene Arten von Übergängen auftreten können. Basierend auf den Eigenschaften der einzelnen Übergangseffekte existiert bereits eine Vielzahl
an Algorithmen zur Detektion von Shots, wobei entweder pixel-, regionen- oder bewegungsbasierte Informationen herangezogen werden. Ein weit verbreiteter Ansatz zur *zeitlichen Segmentierung* ist /Twin Comparison/.\\
Im Allgemeinen wird bei der Twin-Comparison-Methode zwischen der Detektion von abrupten Schnitten und fortlaufenden Übergängen (Ein-, Aus- und Überblendung) unterschieden. Während Schnitte aufgrund bedeutender inhaltlicher Veränderungen zwischen zwei Frames einfach zu detektieren sind, treten bei fortlaufenden Übergängen über mehrere Frames nur geringe Änderungen auf, wodurch eine Detektion erschwert wird. Die Detektion der verschiedenen Übergänge erfolgt durch die Analyse von benachbarten Frames und deren Differenzen. Für diese Auswertung können sowohl einzelne Pixel, beschränkte Regionen oder globale Histogramme herangezogen werden, wobei histogrammbasierte Methoden aufgrund des guten Kompromisses zwischen Berechnungsaufwand und Genauigkeit am häufigsten verwendet werden.\\
Ausgehend von einzelnen Frames wird zunächst für jedes Bild ein Histogramm gebildet, indem die Intensitätswerte der Farbkanäle einer Quantisierung unterzogen werden. Anschließend gilt es, die Differenz von benachbarten Frames zu berechnen. Je größer die Histogramm-Differenz von benachbarten Frames ausfällt, desto größer ist die inhaltliche Veränderung. Basierend auf den Eigenschaften von *abrupten Schnitten* und der Annahme, dass zwei verschiedene Shots unterschiedlichen Inhalt aufweisen, wird ein Schnitt detektiert, sobald die Differenz einen Schwellwert \(T_h\) übersteigt.\\
Fortlaufende Übergänge können auf ähnliche Weise bestimmt werden. Aufgrund der Überlagerung von zwei benachbarten Shots fällt der inhaltliche Unterschied während des Überganges geringer aus als im Falle eines direkten Schnitts. Jedoch ist die Histogramm-Differenz von Framepaaren innerhalb eines Shots am geringsten. Deshalb wird ein zweiter Schwellwert \(T_l\) eingeführt, mit dessen Hilfe Fades, Dissolves und Wipes detektiert werden können. Übersteigt die Differenz von benachbarten Frames den Schwellwert \(T_l\) , so handelt es sich dabei um den möglichen Beginn eines fortlaufenden Überganges. Anschließend werden die Differenzen von nachfolgenden Framepaaren betrachtet, bis \(T_l\) unterschritten wird und das Ende des Übergangseffekts eintritt. Die einzelnen Differenzwerte innerhalb dieses Bereichs werden aufsummiert. Überschreitet die Summe den Schwellwert zur Schnitterkennung \(T_h\), so wird angenommen, dass es sich dabei tatsächlich um einen fortlaufenden Übergang handelt.\\
Diese Methode zur Detektion von Shot-Grenzen wird aufgrund der beiden eingesetzten Schwellwerte als Twin Comparison bezeichnet und ist in der Lage sowohl Schnitte als auch spezielle Übergangseffekte zu detektieren (Einblendung, Ausblendung, Abrupter Schnitt, Dissolve, Wipe, Fade)
* TODO Es existiert ein Retrievalsystem für Insektenbilder. Sie sollen eine Evaluation durchführen. Beschreiben Sie ihre Vorgehensweise.
- Side note: Diese Aufgabe ist in *jeder* Altklausur und sie bringt immer die meisten Punkte
- https://nlp.stanford.edu/IR-book/pdf/08eval.pdf

Zunächst einmal gilt es herauszufinden in welchem Kontext das Retrievalsystem benutzt wird bzw. was das konkrete Einsatzgebiet ist. Grundsätzlich lässt sich ein Retrievalsystem mit Hilfe von den Maßen Recall und Precicision evaluieren. Doch da diese Maße prinzipiell gegeneinander verlaufen, ist es wichtig zu definieren wie sich die Relevanz für das spezifische Einsatzgebiet ergibt und welcher Informationsbedarf besteht. Ohne das der konkrete Informationsbedarf festgelegt ist ließe sich das Insekten-IRS kaum evaluieren. Aus dem Informationsbedarf lässt sich die Relevanz der Ergebnisse die das IRS erzielt, ableiten.

    ImageCLEF - a continuing track of the Cross Language Evaluation Forum that evaluates systems using both textual and pure-image retrieval methods.
    Content-based Access of Image and Video Libraries - a series of IEEE workshops from 1998 to 2001.

 - http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.211.7111&rep=rep1&type=pdf
 - https://link.springer.com/content/pdf/10.1007%2F3-540-48762-X_65.pdf
 - https://pdfs.semanticscholar.org/0754/3d661cc0abef2e5ffa9ad2031c6131c5a740.pdf
